{
  "steps": [
    {
      "title": "<b>Nuxeo Platform</b> Project Template",
      "content": "Welcome in the <b>Nuxeo</b> Codenvy Template. We have instantiated for you a project template. When you build it, it produces a jar that can be deployed on a <b>Nuxeo Platform</b> instance. You can use Codenvy to implement the custom java logic that you would not be able to design and configure using <b>Nuxeo Studio</b>, the configuration environment.<ul><li>[https://connect.nuxeo.com/register/#/ Nuxeo Studio Trial]</li><li>[http://doc.nuxeo.com/x/CBU5AQ Getting Started]</li><li>[http://doc.nuxeo.com/x/EIAV Nuxeo Studio Documentation]</li></ul>",
      "element": "gwt-debug-projectExplorerTree-panel",
      "placement": "RIGHT",
      "actions": [
        {
          "action": "openfile /src/main/java/org/nuxeo/sample/SampleOperation.java"
        }
      ]
    },
    {
      "title": "Sample Automation Operation",
      "content": "This class is an sample operation. An operation in <b>Nuxeo</b> is a “command” that is executed on the server. There are hundreds of default operation in the <b>Nuxeo Platform</b>, that can be assembled using <b>Nuxeo Studio</b>. It is sometimes necessary to implement custom operations for instance for integration with third party system. Just adapt the content of the run method to your requirements!<ul><li>[http://doc.nuxeo.com/x/yIKE Upload your custom operation definition in Nuxeo Studio]</li><li>[http://doc.nuxeo.com/x/Go0ZAQ Understand more about custom operations]</li></ul>",
      "element": "gwt-debug-editorPartStack-contentPanel",
      "placement": "LEFT",
      "xOffset": "85",
      "yOffset": "173"
    },
    {
      "title": "Start a <b>Nuxeo</b> Server and Deploy your Customisation",
      "content": "This button can be used to build the project and deploy it on a <b>Nuxeo Platform</b> instance started in a docker container in the cloud so that you can test your development. If you click on the “Run” button below, server will be automatically started.",
      "element": "gwt-debug-MainToolbar/runApp-true",
      "placement": "LEFT",
      "xOffset": "11",
      "actions": [
        {
          "action": "trigger runApp"
        }
      ]
    },
    {
      "title": "Server link",
      "content": "Click here to access to the <b>Nuxeo Platform</b> instance when it starts.<hr> Default credentials are Administrator/Administrator",
      "element": "gwt-debug-Terminal-tab",
      "placement": "TOP",
      "xOffset": "100"
    },
    {
      "title": "Warning: Temporary Workspace",
      "content": "This project has been created in a temporary workspace which has 2GB of RAM. Your project will be destroyed if you close the tab or become idle.",
      "element": "gwt-debug-temporary-workspace-used-toolbar-button",
      "placement": "TOP",
      "xOffset": "-20"
    },
    {
      "title": "Learn How to customise <b>Nuxeo Platform</b>!",
      "content": "If you haven’t registered to <b>Nuxeo</b>, do not hesitate to do it now. It will give you access to <b>Nuxeo Studio</b> so that you can implement your business logic, with custom forms, workflows, business views etc…  You can also use Codenvy for implementing all the Java part, just go through our documentation for learning more.<ul><li>[http://doc.nuxeo.com Getting Started!]</li></ul>",
      "element": "gwt-debug-dashboard-toolbar-button",
      "width": "400",
      "placement": "BOTTOM",
      "xOffset": "500",
      "skipButton": false,
      "hideBubbleNumber": true,
      "hideArrow": true,
      "nextButtonLabel": "Done"
    }
  ]
}
